#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 1s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=qt-X_qiK5QHqSEhxpmw]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=OTIOL96TT8PgZgSrMOo]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=inLVDFCgjScXi4sAwQI]
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"]: Reading...
module.vpn_routing.data.apstra_blueprint_deployment.dc_1: Reading...
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"]: Read complete after 0s
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"]: Reading...
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"]: Reading...
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"]: Read complete after 0s
module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"]: Read complete after 0s
module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn: Reading...
module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn: Read complete after 0s
module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn: Reading...
module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn: Read complete after 0s
module.vpn_routing.apstra_datacenter_connectivity_template.vpn: Refreshing state... [id=a9085f4e-3a2b-11ee-bad6-617073747261]
module.vpn_routing.data.apstra_blueprint_deployment.dc_1: Read complete after 1s
null_resource.force_redeploy: Refreshing state... [id=2516148661089929956]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # apstra_blueprint_deployment.dc_1 will be updated in-place
  ~ resource "apstra_blueprint_deployment" "dc_1" {
      ~ comment                 = "Deployment by Terraform {{.TerraformVersion}}, Apstra provider {{.ProviderVersion}}, User $USER." -> "$COMMENT Deployment by Terraform {{.TerraformVersion}}, Apstra provider {{.ProviderVersion}}, User $USER."
      ~ has_uncommitted_changes = false -> (known after apply)
      ~ revision_active         = 29 -> (known after apply)
      ~ revision_staged         = 29 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   